frontend/controllers/PerizinanController.php

    public function actionCreate()
    {
        $model = new Perizinan();
         if(Yii::$app->user->identity->role=='perizinan'){
            if ($model->load(Yii::$app->request->post())){
                if ($model->validate()){
                    $id_perizinan = $model->id_perizinan;
                    $names = UploadedFile::getInstances($model, 'file');

                }
                foreach ($names as $name)
                {

                    $path = Yii::getAlias('@frontend/web/bidang-perizinan').'/'.($name->baseName).'.'.$name->extension;
                    if ($name->saveAs($path)){
                        $file = $name->baseName . '.' . $name->extension;
                        $filePath = $path;

                        Yii::$app->db->createCommand()->insert('perizinan', ['file'=>$file, 'filePath' => $filePath,'no_izin'=> $model->no_izin, 'nama_pemilik'=> $model->nama_pemilik, 'lokasi' => $model->lokasi])->execute();
---
INSERT INTO `perizinan` (`file`, `filePath`, `no_izin`, `nama_pemilik`, `lokasi`) VALUES ('SwetaHutauruk_11317008_D3TI.pdf', 'C:\\xampp\\htdocs\\KP\\internal_perizinan/frontend/web/bidang-perizinan/SwetaHutauruk_11317008_D3TI.pdf', '123/12/2020', 'Sweta Marito Hutauruk', 'Medan')